#+PROPERTY: results none
Doesnt work

Inspiration
https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Customizations.html
https://github.com/vidjuheffex/dotemacs/blob/master/emacs.org
https://jamiecollinson.com/blog/my-emacs-config/

** LSP
https://emacs-lsp.github.io/lsp-mode/page/installation/

#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
            (python-mode . lsp)
            ;; if you want which-key integration
            (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
(use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
(use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

; https://emacs.stackexchange.com/questions/55199/what-are-these-prefix-commands-that-start-with-s-l
;; (setq lsp-keymap-prefix "SPC m l")

;; (which-key-declare-prefixes "SPC m" "Major")
;; (evil-leader/set-key 
;; "ml" 'helm-recentf
;; )
#+END_SRC

#+RESULTS:
: SPC m l

